In [1]:
import pandas as pd
import numpy as np

In [3]:
from pandas import Series

Lambda

In [4]:
f = lambda x,y : x + y
f(1,4)

5

In [5]:
def f(x,y):
    return x+y

In [6]:
f = lambda x: x**2
f(3)

9

In [7]:
f = lambda x : x/2
f(3)

1.5

In [8]:
(lambda x: x+1)(5) #이름 지정 안하고 사용

6

In [14]:
ex = np.arange(5) + 1
list(map(lambda x: x**2,ex)) #주로 lambda 부분은 따로 변수에 할당한 후에 변수를 넘긴다.

[1, 4, 9, 16, 25]

In [16]:
f = lambda x, y : x+y
list(map(f,ex,ex)) # 두 개 이상의 argument가 있는 경우에는 두 개의 sequance형을 사용한다.
#python3부터는 list를 적어주지 않으면 메모리주소를 리턴한다.

[2, 4, 6, 8, 10]

In [17]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [18]:
s1.map(lambda x : x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [21]:
z = {1: 'A', 2:'B', 3:'C'}
s1.map(z).head(5) #z의 키값과 동일한 인덱스의 s1 값들이 업데이트됨.

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [31]:
s2 = Series(np.arange(10,20))
s1.map(s2).head(5) #s2의 인덱스값과 동일한 인덱스의 s1 값들이 업데이트됨.

0    10
1    11
2    12
3    13
4    14
dtype: int64

Map

In [26]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [27]:
df.sex.unique() #해당 컬럼에서의 특정한 값 추출하는 함수.

array(['male', 'female'], dtype=object)

In [28]:
df["sex_code"] = df.sex.map({"male":0, "female":1}) 
#딕셔너리를 사용해 sex 컬럼에 값에 따라 sex_code라는 새로운 컬럼에 값을 할당.
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [29]:
df.sex.replace({"male" : 0, "female":1}).head()
#dict 타입으로 replace
#map과 같은 결과

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [30]:
df.sex.replace(["male","female"],[0,1],inplace=True)
#lise 타입으로 replace
df.head(5)
#이제 sex_code 컬럼이 필요없으므로 del이나 drop으로 지우면 된다.
#del df["sex_code"]
#df.drop("sex_code",axis = 1)

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

apply & applymap

In [33]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [34]:
df_info = df[["earn","height","age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [36]:
f = lambda x : x.max() - x.min()
df_info.apply(f) #내장함수를 포함하는 람다식으로 apply가능

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [37]:
df_info.apply(sum) #apply로 sum가능

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [38]:
df_info.sum() #내장함수도 사용 가능함.

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [43]:
def f(x) : 
    return Series([x.min(),x.max()],index = ['min','max'])
df_info.apply(f) #값에 대한 인덱스를 지정해 DataFrame 형태로 뽑기.

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

In [50]:
f = lambda x : -x
#df_info.apply(f).head(5)
#df_info.applymap(f).head(5) 
#applymap은 컬럼 단위가 아닌 element 단위로 적용
#근데 apply랑 다른게 뭐지?

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [42]:
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64